In [118]:
import pandas as pd
from ast import literal_eval

In [119]:
# Read the data into a Pandas DataFrame
keywords_df = pd.read_csv("Resources/keywords.csv")

keywords_df

           id                                           keywords
0         862  [{'id': 931, 'name': 'jealousy'}, {'id': 4290,...
1        8844  [{'id': 10090, 'name': 'board game'}, {'id': 1...
2       15602  [{'id': 1495, 'name': 'fishing'}, {'id': 12392...
3       31357  [{'id': 818, 'name': 'based on novel'}, {'id':...
4       11862  [{'id': 1009, 'name': 'baby'}, {'id': 1599, 'n...
...       ...                                                ...
46414  439050             [{'id': 10703, 'name': 'tragic love'}]
46415  111109  [{'id': 2679, 'name': 'artist'}, {'id': 14531,...
46416   67758                                                 []
46417  227506                                                 []
46418  461257                                                 []

[46419 rows x 2 columns]

In [120]:
# Rename "id" column to "movie_id" so it won't be confused with other id numbers
keywords_df.rename(columns={"id":"movie_id"}, inplace=True)

keywords_df

       movie_id                                           keywords
0           862  [{'id': 931, 'name': 'jealousy'}, {'id': 4290,...
1          8844  [{'id': 10090, 'name': 'board game'}, {'id': 1...
2         15602  [{'id': 1495, 'name': 'fishing'}, {'id': 12392...
3         31357  [{'id': 818, 'name': 'based on novel'}, {'id':...
4         11862  [{'id': 1009, 'name': 'baby'}, {'id': 1599, 'n...
...         ...                                                ...
46414    439050             [{'id': 10703, 'name': 'tragic love'}]
46415    111109  [{'id': 2679, 'name': 'artist'}, {'id': 14531,...
46416     67758                                                 []
46417    227506                                                 []
46418    461257                                                 []

[46419 rows x 2 columns]

In [121]:
# Drop empty rows
# code example from https://sparkbyexamples.com/pandas/pandas-delete-rows-based-on-column-value/

keywords_df.drop(keywords_df[keywords_df["keywords"] == "[]"].index, inplace=True)

In [122]:
keywords_df

       movie_id                                           keywords
0           862  [{'id': 931, 'name': 'jealousy'}, {'id': 4290,...
1          8844  [{'id': 10090, 'name': 'board game'}, {'id': 1...
2         15602  [{'id': 1495, 'name': 'fishing'}, {'id': 12392...
3         31357  [{'id': 818, 'name': 'based on novel'}, {'id':...
4         11862  [{'id': 1009, 'name': 'baby'}, {'id': 1599, 'n...
...         ...                                                ...
46409     84419  [{'id': 9748, 'name': 'revenge'}, {'id': 9826,...
46410    390959            [{'id': 224180, 'name': 'blair witch'}]
46411    289923  [{'id': 616, 'name': 'witch'}, {'id': 2035, 'n...
46414    439050             [{'id': 10703, 'name': 'tragic love'}]
46415    111109  [{'id': 2679, 'name': 'artist'}, {'id': 14531,...

[31624 rows x 2 columns]

In [123]:
# explode list of dictionaries to one dictionary per line
# solution from https://stackoverflow.com/questions/65621510/how-to-split-a-pandas-column-with-a-list-of-dicts-into-separate-columns-for-each
keywords_df.keywords = keywords_df.keywords.apply(literal_eval)
keywords_df = keywords_df.explode("keywords", ignore_index=True)

keywords_df

        movie_id                               keywords
0            862        {'id': 931, 'name': 'jealousy'}
1            862            {'id': 4290, 'name': 'toy'}
2            862            {'id': 5202, 'name': 'boy'}
3            862     {'id': 6054, 'name': 'friendship'}
4            862        {'id': 9713, 'name': 'friends'}
...          ...                                    ...
158675    289923  {'id': 11800, 'name': 'mockumentary'}
158676    439050   {'id': 10703, 'name': 'tragic love'}
158677    111109         {'id': 2679, 'name': 'artist'}
158678    111109          {'id': 14531, 'name': 'play'}
158679    111109        {'id': 215397, 'name': 'pinoy'}

[158680 rows x 2 columns]

In [124]:
# split dictionary into separate columns
# solution from https://www.skytowner.com/explore/splitting_dictionary_into_separate_columns_in_pandas_dataframe
keywords_df = pd.concat([keywords_df, keywords_df["keywords"].apply(pd.Series)], axis=1)

keywords_df

        movie_id                               keywords      id          name
0            862        {'id': 931, 'name': 'jealousy'}     931      jealousy
1            862            {'id': 4290, 'name': 'toy'}    4290           toy
2            862            {'id': 5202, 'name': 'boy'}    5202           boy
3            862     {'id': 6054, 'name': 'friendship'}    6054    friendship
4            862        {'id': 9713, 'name': 'friends'}    9713       friends
...          ...                                    ...     ...           ...
158675    289923  {'id': 11800, 'name': 'mockumentary'}   11800  mockumentary
158676    439050   {'id': 10703, 'name': 'tragic love'}   10703   tragic love
158677    111109         {'id': 2679, 'name': 'artist'}    2679        artist
158678    111109          {'id': 14531, 'name': 'play'}   14531          play
158679    111109        {'id': 215397, 'name': 'pinoy'}  215397         pinoy

[158680 rows x 4 columns]

In [125]:
# drop unneccessary columns
clean_keywords_df = keywords_df.drop(columns=["keywords","id"])

# rename keyword column
clean_keywords_df.rename(columns={"name":"keyword"}, inplace=True)

clean_keywords_df

        movie_id       keyword
0            862      jealousy
1            862           toy
2            862           boy
3            862    friendship
4            862       friends
...          ...           ...
158675    289923  mockumentary
158676    439050   tragic love
158677    111109        artist
158678    111109          play
158679    111109         pinoy

[158680 rows x 2 columns]

In [126]:
# create column with number of times the keyword appears in the column
# solution from https://stackoverflow.com/questions/22391433/count-the-frequency-that-a-value-occurs-in-a-dataframe-column
# clean_keywords_df["occurrence"]=clean_keywords_df.keyword.map(clean_keywords_df.keyword.value_counts())

In [127]:
# clean_keywords_df.sort_values("occurrence").head(50)

In [128]:
clean_keywords_df.to_csv("Resources/clean_keywords.csv", encoding='utf8', index=False)